
## Plan Result (terraform/aws/hitohub/prod)

[CI link](https://github.com/boxp/arch/actions/runs/8927516270)


<pre><code>Plan: 7 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_ecr_lifecycle_policy.hitohub_backend_prod_lifecycle_policy
  * aws_ecr_lifecycle_policy.hitohub_frontend_prod_lifecycle_policy
  * aws_ecr_repository.hitohub_backend_prod
  * aws_ecr_repository.hitohub_frontend_prod
  * aws_iam_policy.hitohub_prod_gha_policy
  * aws_iam_role.hitohub_prod_gha_role
  * aws_iam_role_policy_attachment.hitohubprod_gha_policy_attachment


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecr_lifecycle_policy.hitohub_backend_prod_lifecycle_policy will be created
  + resource "aws_ecr_lifecycle_policy" "hitohub_backend_prod_lifecycle_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "limit the number of images to 3"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 3
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "hitohub-backend-prod"
    }

  # aws_ecr_lifecycle_policy.hitohub_frontend_prod_lifecycle_policy will be created
  + resource "aws_ecr_lifecycle_policy" "hitohub_frontend_prod_lifecycle_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "limit the number of images to 3"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 3
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "hitohub-frontend-prod"
    }

  # aws_ecr_repository.hitohub_backend_prod will be created
  + resource "aws_ecr_repository" "hitohub_backend_prod" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "hitohub-backend-prod"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + encryption_configuration {
          + encryption_type = "KMS"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.hitohub_frontend_prod will be created
  + resource "aws_ecr_repository" "hitohub_frontend_prod" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "hitohub-frontend-prod"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + encryption_configuration {
          + encryption_type = "KMS"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_iam_policy.hitohub_prod_gha_policy will be created
  + resource "aws_iam_policy" "hitohub_prod_gha_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for hitohub prod GitHub Actions"
      + id               = (known after apply)
      + name             = "hitohub-prod-gha-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:PutImage",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:UploadLayerPart",
                          + "ecr:CompleteLayerUpload",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr:ap-northeast-1:839695154978:repository/hitohub-*-prod"
                    },
                  + {
                      + Action   = [
                          + "ecr:GetAuthorizationToken",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role.hitohub_prod_gha_role will be created
  + resource "aws_iam_role" "hitohub_prod_gha_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                              + "token.actions.githubusercontent.com:sub" = "repo:boxp/vr-match:ref:refs/heads/master"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::839695154978:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "hitohub-prod-gha-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.hitohubprod_gha_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "hitohubprod_gha_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "hitohub-prod-gha-role"
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":351,"Program":"tfcmt","SHA1":"167cbd7553e9b2d60ba646fb31563a3758190236","Target":"terraform/aws/hitohub/prod","Vars":{},"WorkflowName":"pull_request_target"} -->